back-api/app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("color", "created_at", "message", "page_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["color", "fuchsia"], ["created_at", "2015-08-17 19:33:55.684582"], ["message", "asfasgkamsd\nasklfasmf\n"], ["page_id", 16], ["updated_at", "2015-08-17 19:33:55.684582"]]
---
  def create
    comment = Comment.create(message: params[:comment][:message], page_id: params[:comment][:page_id], color: params[:comment][:color])