back-api/app/controllers/api/v1/pages_controller.rb

SELECT  "pages".* FROM "pages"   ORDER BY "pages"."id" DESC LIMIT 5
---
  def index
    render json: Page.last(5).reverse

SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = $1 LIMIT 1  [["id", 15]]
---
  def show
    render json: Page.find(params[:id])

INSERT INTO "pages" ("created_at", "updated_at", "url") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-08-17 03:52:10.626347"], ["updated_at", "2015-08-17 03:52:10.626347"], ["url", "sarasas"]]
SELECT  "pages".* FROM "pages"  WHERE "pages"."url" = 'http://www.pagina12.com.ar/diario/elpais/1-279532-2015-08-17.html' LIMIT 1
---
  def create
    parsed_page = MetaInspector.new(params[:page][:url], download_images: false)
    page = Page.create_with(title: parsed_page.best_title, host: parsed_page.host).find_or_create_by(url: params[:page][:url])