app/controllers/api/v1/ballots_controller.rb

SELECT  "ballots".* FROM "ballots"   ORDER BY "ballots"."id" ASC LIMIT 1
---
  def show
    render json: Ballot.first